In [1]:
library(tidyr)
library(dplyr)

wide = data.frame(Student = c("Sean", "Taylor", "Ellie", "John"),Test1 = c(.84,.9,.8,.95),
                  Test2 = c(.95,.88,.7,.87), Test3 = c(.9, .94, .8, .98))

long = gather(wide, Test1, Test2, Test3, key = 'Test', value = 'Grade')


spread(long, key = 'Student', value = 'Grade')



d1 = data_frame(Name = c("Sean", "William","Sophia", "John", "Joseph"), 
                Major = c("Actuarial Math", "Psychology", "Marketing", "Marketing", "Finance"),
                GPA = c(3.98,3.6,3.2,2.5,3.4))

d2 = data_frame(Name = c("Sean", "Taylor","Ellie", "John", "Joseph"), 
                Major = c("Actuarial Math", "English", "History", "Marketing", "Finance"),
                Salary = c(65000,40000,45000,50000,60000))

left_join(d1,d2, by = "Name")
right_join(d1,d2, by = "Name")
inner_join(d1,d2, by = "Name")
full_join(d1,d2, by = "Name")
semi_join(d1,d2, by = "Name")
anti_join(d1,d2, by = "Name")

left_join(d1,d2, by = c("Name", "Major"))
right_join(d1,d2, by = c("Name", "Major"))
inner_join(d1,d2, by = c("Name", "Major"))
full_join(d1,d2, by = c("Name", "Major"))
semi_join(d1,d2, by = c("Name", "Major"))
anti_join(d1,d2, by = c("Name", "Major"))

Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

  Test  Ellie John Sean Taylor
1 Test1 0.8   0.95 0.84 0.90
2 Test2 0.7   0.87 0.95 0.88
3 Test3 0.8   0.98 0.90 0.94

  Name    Major.x        GPA  Major.y        Salary
1 Sean    Actuarial Math 3.98 Actuarial Math 65000
2 William Psychology     3.60 NA                NA
3 Sophia  Marketing      3.20 NA                NA
4 John    Marketing      2.50 Marketing      50000
5 Joseph  Finance        3.40 Finance        60000

  Name   Major.x        GPA  Major.y        Salary
1 Sean   Actuarial Math 3.98 Actuarial Math 65000
2 Taylor NA               NA English        40000
3 Ellie  NA               NA History        45000
4 John   Marketing      2.50 Marketing      50000
5 Joseph Finance        3.40 Finance        60000

  Name   Major.x        GPA  Major.y        Salary
1 Sean   Actuarial Math 3.98 Actuarial Math 65000
2 John   Marketing      2.50 Marketing      50000
3 Joseph Finance        3.40 Finance        60000

  Name    Major.x        GPA  Major.y        Salary
1 Sean    Actuarial Math 3.98 Actuarial Math 65000
2 William Psychology     3.60 NA                NA
3 Sophia  Marketing      3.20 NA                NA
4 John    Marketing      2.50 Marketing      50000
5 Joseph  Finance        3.40 Finance        60000
6 Taylor  NA               NA English        40000
7 Ellie   NA               NA History        45000

  Name   Major          GPA
1 Sean   Actuarial Math 3.98
2 John   Marketing      2.50
3 Joseph Finance        3.40

  Name    Major      GPA
1 William Psychology 3.6
2 Sophia  Marketing  3.2

  Name    Major          GPA  Salary
1 Sean    Actuarial Math 3.98 65000
2 William Psychology     3.60    NA
3 Sophia  Marketing      3.20    NA
4 John    Marketing      2.50 50000
5 Joseph  Finance        3.40 60000

  Name   Major          GPA  Salary
1 Sean   Actuarial Math 3.98 65000
2 Taylor English          NA 40000
3 Ellie  History          NA 45000
4 John   Marketing      2.50 50000
5 Joseph Finance        3.40 60000

  Name   Major          GPA  Salary
1 Sean   Actuarial Math 3.98 65000
2 John   Marketing      2.50 50000
3 Joseph Finance        3.40 60000

  Name    Major          GPA  Salary
1 Sean    Actuarial Math 3.98 65000
2 William Psychology     3.60    NA
3 Sophia  Marketing      3.20    NA
4 John    Marketing      2.50 50000
5 Joseph  Finance        3.40 60000
6 Taylor  English          NA 40000
7 Ellie   History          NA 45000

  Name   Major          GPA
1 Sean   Actuarial Math 3.98
2 John   Marketing      2.50
3 Joseph Finance        3.40

  Name    Major      GPA
1 William Psychology 3.6
2 Sophia  Marketing  3.2